### What is Pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

https://pandas.pydata.org/about/index.html

### Pandas Series

A Pandas Series is like a column in a table. It is a 1-D array holding data of any type.

#Importing Pandas

In [1]:
import pandas as pd
import numpy as np

### Series from lists

In [4]:
#strings

a = ['india','pakistan','russia','china','japan','switzerland']

pd.Series(a)

0          india
1       pakistan
2         russia
3          china
4          japan
5    switzerland
dtype: object

In [5]:
b = [15,67,89,45,81]

pd.Series(b)

0    15
1    67
2    89
3    45
4    81
dtype: int64

In [6]:
#custom index

marks = [99,91,93,81]
subjects = ['maths','science','english','hindi']

pd.Series(marks,index=subjects)

maths      99
science    91
english    93
hindi      81
dtype: int64

In [7]:
# setting a name

marks = pd.Series(marks,index=subjects, name = 'sumit')
marks

maths      99
science    91
english    93
hindi      81
Name: sumit, dtype: int64

#Series from dict

In [11]:
marks = {
    'maths' : 99,
    'hindi' : 91,
    'science' : 93,
    'english' : 81
}

marks_series = pd.Series(marks,name = 'sumit')
marks_series

maths      99
hindi      91
science    93
english    81
Name: sumit, dtype: int64

#Series Attributes

In [13]:
#size

marks_series.size

4

In [14]:
#dtype

marks_series.dtype

dtype('int64')

In [15]:
#name

marks_series.name

'sumit'

In [19]:
marks_series.is_unique

True

In [22]:
pd.Series([1,2,1,4]).is_unique

False

In [23]:
#index

marks_series.index

Index(['maths', 'hindi', 'science', 'english'], dtype='object')

In [25]:
#values

marks_series.values

array([99, 91, 93, 81])

#Read from csv

In [29]:
pd.read_csv('/content/subs.csv')

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [37]:
pd.read_csv('/content/subs.csv').squeeze()

0       48
1       57
2       40
3       43
4       44
      ...
360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

In [39]:
pd.read_csv('/content/kohli_ipl.csv', index_col = 'match_no').squeeze()

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [41]:
movies = pd.read_csv('/content/bollywood.csv',index_col='movie').squeeze()
movies

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Hum Tumhare Hain Sanam                    Shah Rukh Khan
Aankhen (2002 film)                     Amitabh Bachchan
Saathiya (film)                             Vivek Oberoi
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Name: lead, Length: 1500, dtype: object

In [42]:
#head and tail

movies.head()

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
Name: lead, dtype: object

In [43]:
movies.tail()

movie
Hum Tumhare Hain Sanam      Shah Rukh Khan
Aankhen (2002 film)       Amitabh Bachchan
Saathiya (film)               Vivek Oberoi
Company (film)                  Ajay Devgn
Awara Paagal Deewana          Akshay Kumar
Name: lead, dtype: object

In [44]:
movies.head(3)

movie
Uri: The Surgical Strike                Vicky Kaushal
Battalion 609                             Vicky Ahuja
The Accidental Prime Minister (film)      Anupam Kher
Name: lead, dtype: object

In [45]:
#sample

movies.sample()

movie
Mercury (film)    Prabhu Deva
Name: lead, dtype: object

In [46]:
movies.sample(5)

movie
Guzaarish (film)       Hrithik Roshan
Bhaag Johnny              Kunal Khemu
1920 (film)          Rajniesh Duggall
Gold (2018 film)         Akshay Kumar
Daas Dev            Yogesh Raj Mishra
Name: lead, dtype: object

In [47]:
#value_counts - > movie

movies.value_counts()

lead
Akshay Kumar         48
Amitabh Bachchan     45
Ajay Devgn           38
Salman Khan          31
Sanjay Dutt          26
                     ..
Seema Azmi            1
Akanksha Puri         1
Charanpreet Insan     1
Jaideep Ahlawat       1
Monali Thakur         1
Name: count, Length: 566, dtype: int64

In [48]:
#sort_values - > inplace

movies.sort_values()

movie
Qaidi Band                            Aadar Jain
Roar: Tigers of the Sundarbans      Aadil Chahal
Lipstick Under My Burkha            Aahana Kumra
Raat Gayi Baat Gayi?                Aamir Bashir
Talaash: The Answer Lies Within       Aamir Khan
                                        ...
Dil Toh Deewana Hai                  Zeenat Aman
Sallu Ki Shaadi                      Zeenat Aman
Strings of Passion                   Zeenat Aman
Dunno Y... Na Jaane Kyon             Zeenat Aman
Taj Mahal: An Eternal Love Story     Zulfi Sayed
Name: lead, Length: 1500, dtype: object

In [53]:
movies.sort_values(ascending=False).head(3)

movie
Taj Mahal: An Eternal Love Story    Zulfi Sayed
Dil Toh Deewana Hai                 Zeenat Aman
Strings of Passion                  Zeenat Aman
Name: lead, dtype: object

In [49]:
#sort_index - > inplace

movies.sort_index()

movie
1920 (film)                   Rajniesh Duggall
1920: London                     Sharman Joshi
1920: The Evil Returns             Vicky Ahuja
1971 (2007 film)                Manoj Bajpayee
2 States (2014 film)              Arjun Kapoor
                                   ...
Zindagi 50-50                      Veena Malik
Zindagi Na Milegi Dobara        Hrithik Roshan
Zindagi Tere Naam           Mithun Chakraborty
Zokkomon                       Darsheel Safary
Zor Lagaa Ke...Haiya!            Meghan Jadhav
Name: lead, Length: 1500, dtype: object

In [54]:
movies.sort_index(inplace = True) # permanent changes

In [55]:
movies

movie
1920 (film)                   Rajniesh Duggall
1920: London                     Sharman Joshi
1920: The Evil Returns             Vicky Ahuja
1971 (2007 film)                Manoj Bajpayee
2 States (2014 film)              Arjun Kapoor
                                   ...
Zindagi 50-50                      Veena Malik
Zindagi Na Milegi Dobara        Hrithik Roshan
Zindagi Tere Naam           Mithun Chakraborty
Zokkomon                       Darsheel Safary
Zor Lagaa Ke...Haiya!            Meghan Jadhav
Name: lead, Length: 1500, dtype: object